cask_args appdir: "/Applications"

# tap (repos)
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'

## must have brews ##
brew 'bash'
brew 'imagemagick'
brew 'git'
# brew 'homebrew/binary/kwm'
brew 'mas'
brew 'node'
brew 'wget'
brew 'zsh'

## must have casks ##
cask 'appcleaner'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner'
cask 'seil'
cask 'firefox'
cask 'caskroom/versions/firefoxdeveloperedition'
cask 'slack'
cask 'caskroom/versions/sublime-text3'
cask 'filezilla'
cask 'colorpicker'
cask 'google-chrome'
cask 'caskroom/versions/google-chrome-canary'

# osx quicklook plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# fonts
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-open-sans'
cask 'font-bebas-neue'

## other apps ##
# cask 'amethyst'
# cask 'moom'
# cask 'audacity'
# cask 'honer'
# cask 'musescore'
# cask 'noejectdelay'
# cask 'prepros'
# cask 'shortcat'
# cask 'skitch'
# cask 'vivaldi'
# cask 'postman'

# unknown apps:
cask 'suspicious-package'


## apps from other users:
# tap 'homebrew/binary'
# tap 'homebrew/core'
# tap 'homebrew/science'
# tap 'homebrew/services'
# brew 'xz'
# brew 'pkg-config'
# brew 'libpng'
# brew 'freetype'
# brew 'fontconfig'
# brew 'pixman'
# brew 'gettext'
# brew 'libffi'
# brew 'glib'
# brew 'cairo'
# brew 'ctags'
# brew 'fasd'
# brew 'fftw'
# brew 'gdbm'
# brew 'jpeg'
# brew 'libtiff'
# brew 'pcre'
# brew 'gobject-introspection'
# brew 'gdk-pixbuf'
# brew 'giflib'
# brew 'icu4c'
# brew 'harfbuzz'
# brew 'libtool'
# brew 'little-cms2'
# brew 'libcroco'
# brew 'pango'
# brew 'libgsf'
# brew 'librsvg'
# brew 'webp'
# brew 'jp2a'
# brew 'libexif'
# brew 'openssl'
# brew 'openjpeg'
# brew 'orc'
# brew 'poppler'
# brew 'py2cairo'
# brew 'pygobject3'
# brew 'readline'
# brew 'sqlite'
# brew 'python'
# brew 'spaceman-diff'
# brew 'unar'
# brew 'youtube-dl'
# brew 'zsh-completions'
# brew 'homebrew/science/vips', args: ['with-imagemagick', 'with-webp']
